In [3]:
#data load
import pandas as pd
df = pd.read_excel("sales_raw_500.xlsx")

In [6]:
df

     Order_ID Order_Date Customer Region  Product  Sales   Cost
0        1001 2023-01-13    Rohit  South   Mobile  23289  19118
1        1002 2023-10-07     Aman   West   Laptop   8905   5593
2        1003 2023-11-05    Rahul  South  Monitor  59987  39959
3        1004 2024-02-19    Rahul  South  Printer  49597  33892
4        1005 2024-01-26   Anjali  North   Laptop  54797  34468
..        ...        ...      ...    ...      ...    ...    ...
515      1389 2024-02-12    Vikas  North   Laptop  17924  12145
516      1496 2023-04-24    Kiran  North  Printer  23434  16388
517      1031 2023-02-19    Vikas   East  Printer  58883  43579
518      1317 2023-07-05     Aman  North   Laptop  76781  66865
519      1409 2024-01-16    Pooja  North  Monitor  19969  13586

[520 rows x 7 columns]

In [8]:
df.isnull().sum()

Order_ID       0
Order_Date    18
Customer       0
Region         0
Product        0
Sales          0
Cost           0
dtype: int64

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 520 entries, 0 to 519
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Order_ID    520 non-null    int64
 1   Order_Date  502 non-null    datetime64[ns]
 2   Customer    520 non-null    object
 3   Region      520 non-null    object
 4   Product     520 non-null    object
 5   Sales       520 non-null    int64
 6   Cost        520 non-null    int64
dtypes: datetime64[ns](1), int64(3), object(3)
memory usage: 28.6+ KB

In [11]:
df.drop_duplicates()

     Order_ID Order_Date Customer Region  Product  Sales   Cost
0        1001 2023-01-13    Rohit  South   Mobile  23289  19118
1        1002 2023-10-07     Aman   West   Laptop   8905   5593
2        1003 2023-11-05    Rahul  South  Monitor  59987  39959
3        1004 2024-02-19    Rahul  South  Printer  49597  33892
4        1005 2024-01-26   Anjali  North   Laptop  54797  34468
..        ...        ...      ...    ...      ...    ...    ...
495      1496 2023-04-24    Kiran  North  Printer  23434  16388
496      1497 2023-06-27   Anjali  South   Laptop  49007  35970
497      1498 2023-05-08     Aman   East   Tablet  19160  15636
498      1499        NaT    Pooja   West   Mobile  59266  44326
499      1500 2023-10-07    Vikas  North  Printer  34567  22426

[500 rows x 7 columns]

In [12]:
df.isnull().sum()

Order_ID       0
Order_Date    18
Customer       0
Region         0
Product        0
Sales          0
Cost           0
dtype: int64

In [15]:
df=df.dropna()

In [16]:
df.isnull().sum()

Order_ID      0
Order_Date    0
Customer      0
Region        0
Product       0
Sales         0
Cost          0
dtype: int64

In [17]:
df['Profit']=df['Sales']-df['Cost']

C:\Users\sweta\AppData\Local\Temp\ipykernel_11152\1753827217.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Profit']=df['Sales']-df['Cost']

In [20]:
#data column fix
df['Order_Date']=pd.to_datetime(df['Order_Date'])

C:\Users\sweta\AppData\Local\Temp\ipykernel_11152\3742283616.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Order_Date']=pd.to_datetime(df['Order_Date'])

In [21]:
df.head(2)

   Order_ID Order_Date Customer Region Product  Sales   Cost  Profit
0      1001 2023-01-13    Rohit  South  Mobile  23289  19118    4171
1      1002 2023-10-07     Aman   West  Laptop   8905   5593    3312

In [22]:
df['Year'] = df['Order_Date'].dt.year
df['Month'] = df['Order_Date'].dt.month_name()

C:\Users\sweta\AppData\Local\Temp\ipykernel_11152\2036204764.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Year'] = df['Order_Date'].dt.year
C:\Users\sweta\AppData\Local\Temp\ipykernel_11152\2036204764.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Month'] = df['Order_Date'].dt.month_name()

In [23]:
df

,Order_ID,Order_Date,Customer,Region,Product,Sales,Cost,Profit,Year,Month
0,1001,2023-01-13,Rohit,South,Mobile,23289,19118,4171,2023,January
1,1002,2023-10-07,Aman,West,Laptop,8905,5593,3312,2023,October
2,1003,2023-11-05,Rahul,South,Monitor,59987,39959,20028,2023,November
3,1004,2024-02-19,Rahul,South,Printer,49597,33892,15705,2024,February
4,1005,2024-01-26,Anjali,North,Laptop,54797,34468,20329,2024,January
...,...,...,...,...,...,...,...,...,...,...
515,1389,2024-02-12,Vikas,North,Laptop,17924,12145,5779,2024,February
516,1496,2023-04-24,Kiran,North,Printer,23434,16388,7046,2023,April
517,1031,2023-02-19,Vikas,East,Printer,58883,43579,15304,2023,February
518,1317,2023-07-05,Aman,North,Laptop,76781,66865,9916,2023,July
519,1409,2024-01-16,Pooja,North,Monitor,19969,13586,6383,2024,January

In [24]:
df.isna().sum()

Order_ID      0
Order_Date    0
Customer      0
Region        0
Product       0
Sales         0
Cost          0
Profit        0
Year          0
Month         0
dtype: int64

In [ ]:
#analysis

In [33]:
total_sales, total_cost, total_profit = (
    df['Sales'].sum(),
    df['Cost'].sum(),
    df['Profit'].sum()
)

print(f"Total Sales  : {total_sales:,}")
print(f"Total Cost   : {total_cost:,}")
print(f"Total Profit : {total_profit:,}")

Total Sales  : 20,607,279
Total Cost   : 15,386,555
Total Profit : 5,220,724

In [27]:
#Sales & Profit by Year
df.groupby('Year')[['Sales','Profit']].sum().reset_index()

   Year     Sales   Profit
0  2023  16892485  4305520
1  2024   3714794   915204

In [30]:
#Monthly sales trend
month_order = [
    'January','February','March','April','May','June',
    'July','August','September','October','November','December'
]

df['Month'] = pd.Categorical(df['Month'], categories=month_order, ordered=True)
df.groupby('Month')['Sales'].sum().sort_index()

C:\Users\sweta\AppData\Local\Temp\ipykernel_11152\1062403878.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Month'] = pd.Categorical(df['Month'], categories=month_order, ordered=True)
C:\Users\sweta\AppData\Local\Temp\ipykernel_11152\1062403878.py:8: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby('Month')['Sales'].sum().sort_index()

Month
January      2428596
February     2753412
March        2853678
April        1021131
May          1589894
June         1310781
July         1729710
August       1851789
September    1160899
October      1391962
November     1109145
December     1406282
Name: Sales, dtype: int64

In [31]:
#Region-wise Performance
df.groupby('Region')[['Sales','Profit']].sum().sort_values(by='Sales', ascending=False)

          Sales   Profit
Region
North   5543975  1463570
South   5311426  1285417
West    4925513  1220322
East    4826365  1251415

In [ ]:
'''Which region is most profitable?->North

Which region needs improvement?->East'''

In [32]:
#Sales & Profit by Product
df.groupby('Product')[['Sales','Profit']].sum().sort_values(by='Profit', ascending=False)

           Sales   Profit
Product
Printer  4693571  1200773
Tablet   4203535  1076012
Laptop   4127453  1013727
Monitor  3843667   994495
Mobile   3739053   935717

In [ ]:
#Top customers by sales
df.groupby('Customer')['Sales'].sum().sort_values(ascending=False).head(10)

In [35]:
df['Profit_Margin_%'] = (df['Profit'] / df['Sales']) * 100
#Average margin by product
df.groupby('Product')['Profit_Margin_%'].mean().sort_values(ascending=False)

C:\Users\sweta\AppData\Local\Temp\ipykernel_11152\4192540541.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Profit_Margin_%'] = (df['Profit'] / df['Sales']) * 100

Product
Printer    25.611333
Tablet     25.584053
Mobile     25.497098
Monitor    25.298163
Laptop     24.175639
Name: Profit_Margin_%, dtype: float64

In [36]:
df

,Order_ID,Order_Date,Customer,Region,Product,Sales,Cost,Profit,Year,Month,Profit_Margin_%
0,1001,2023-01-13,Rohit,South,Mobile,23289,19118,4171,2023,January,17.909743
1,1002,2023-10-07,Aman,West,Laptop,8905,5593,3312,2023,October,37.192588
2,1003,2023-11-05,Rahul,South,Monitor,59987,39959,20028,2023,November,33.387234
3,1004,2024-02-19,Rahul,South,Printer,49597,33892,15705,2024,February,31.665222
4,1005,2024-01-26,Anjali,North,Laptop,54797,34468,20329,2024,January,37.098746
...,...,...,...,...,...,...,...,...,...,...,...
515,1389,2024-02-12,Vikas,North,Laptop,17924,12145,5779,2024,February,32.241687
516,1496,2023-04-24,Kiran,North,Printer,23434,16388,7046,2023,April,30.067423
517,1031,2023-02-19,Vikas,East,Printer,58883,43579,15304,2023,February,25.990524
518,1317,2023-07-05,Aman,North,Laptop,76781,66865,9916,2023,July,12.914653
519,1409,2024-01-16,Pooja,North,Monitor,19969,13586,6383,2024,January,31.964545

In [37]:
df.to_csv('Sales_cleaned_data.csv',index=False)

In [ ]:
#graphs for visuals